       01 EMP-RECORD.
           05 EMP-GROUP.
              15 EMP-NAME PIC 99.
              15 EMP-SUBGROUP.
                 20 EMP-NAME PIC 99.
           05 EMP-GROUP2.
              10 EMP-SURNAME PIC XX.