       01 EMP-RECORD.
           05 EMP-NAME PIC 99.
           05 EMP-SURNAME PIC XX.
           05 EMP-POSITION PIC X.
           05 EMP-SALARY PIC XX COMP.